In [78]:
import pandas as pd

In [ ]:
#series: pandas 1D array that can hold any data type; single column in a spreadsheet

In [42]:
data=[100,102,104]
series=pd.Series(data,index=['a','b','c'])
series

a    100
b    102
c    104
dtype: int64

In [47]:
series.loc['c']
int(series.loc['c'])

104

In [32]:
series.loc['a']='hiiii'
series

C:\Users\tina\AppData\Local\Temp\ipykernel_17288\1771483423.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'hiiii' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  series.loc['a']='hiiii'

a    hiiii
b      102
c      104
dtype: object

In [33]:
series.iloc[2]
series.iloc[0]

'hiiii'

In [34]:
series.loc['a']=100
series[series>101]

b    102
c    104
dtype: object

In [41]:
#break
#________________________________________________________________

In [39]:
calories={'day 1':1750,'day 2':2000,'day 3':1700}
ex=pd.Series(calories)
ex

day 1    1750
day 2    2000
day 3    1700
dtype: int64

In [49]:
ex.loc['day 3']

np.int64(1700)

In [50]:
int(ex.loc['day 3'])

1700

In [52]:
ex.loc['day 2']+=500
ex

day 1    1750
day 2    2500
day 3    1700
dtype: int64

In [57]:
ex[ex<2500]

day 1    1750
day 3    1700
dtype: int64

In [2]:
import pandas as pd

In [3]:
#dataframe: tabular data structure w rows and columns (2 dimensional)

In [4]:
data={"name":['tina','pari','parinita'],
      "age":[19,20,50]
     }
df=pd.DataFrame(data,index=["emp1","emp2","emp3"])
df

          name  age
emp1      tina   19
emp2      pari   20
emp3  parinita   50

In [5]:
print(df.loc["emp3"])
print()
df.iloc[0]

name    parinita
age           50
Name: emp3, dtype: object

name    tina
age       19
Name: emp1, dtype: object

In [6]:
#adding a new column
df["job"]=["cook","student","swimmer"]
df

          name  age      job
emp1      tina   19     cook
emp2      pari   20  student
emp3  parinita   50  swimmer

In [9]:
#adding a new row
newrow=pd.DataFrame([{"name":"teens","age":25,"job":"dancer"}], index=["emp4"])
df=pd.concat([df,newrow],ignore_index=False)
df

          name  age      job
emp1      tina   19     cook
emp2      pari   20  student
emp3  parinita   50  swimmer
0        teens   25   dancer
emp4     teens   25   dancer

In [8]:
print(df.index)

Index(['emp1', 'emp2', 'emp3', 0], dtype='object')

In [11]:
df = df.drop(0)
df

          name  age      job
emp1      tina   19     cook
emp2      pari   20  student
emp3  parinita   50  swimmer
emp4     teens   25   dancer

In [16]:
#adding new rows
newrows=pd.DataFrame([{"name":"pana","age":60,"job":"singer"},
                      {"name":"tapa","age":10,"job":"painter"},
                      {"name":"tipi","age":15,"job":"firefighter"}], 
                     index=["emp5","emp6","emp7"])
df=pd.concat([df,newrows],ignore_index=False)
df

          name  age          job
emp1      tina   19         cook
emp2      pari   20      student
emp3  parinita   50      swimmer
emp4     teens   25       dancer
emp5      pana   60       singer
emp6      tapa   10      painter
emp7      tipi   15  firefighter

In [ ]:
#importing csv and json files

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('data.csv')
df.head()

   No        Name  Type1   Type2  Height  Weight  Legendary
0   1   Bulbasaur  Grass  Poison     0.7     6.9          0
1   2     Ivysaur  Grass  Poison     1.0    13.0          0
2   3    Venusaur  Grass  Poison     2.0   100.0          0
3   4  Charmander   Fire     NaN     0.6     8.5          0
4   5  Charmeleon   Fire     NaN     1.1    19.0          0

In [12]:
#accessing by columns
print(df['Name'].tail(5))
print()
print(df['Weight'].tail(5))
print()
print(df[['Name','Height','Weight']].tail(5))

145      Moltres
146      Dratini
147    Dragonair
148    Dragonite
149       Mewtwo
Name: Name, dtype: object

145     60.0
146      3.3
147     16.5
148    210.0
149    122.0
Name: Weight, dtype: float64

          Name  Height  Weight
145    Moltres     2.0    60.0
146    Dratini     1.8     3.3
147  Dragonair     4.0    16.5
148  Dragonite     2.2   210.0
149     Mewtwo     2.0   122.0

In [14]:
#accessing by rows
df.loc[0]

No                   1
Name         Bulbasaur
Type1            Grass
Type2           Poison
Height             0.7
Weight             6.9
Legendary            0
Name: 0, dtype: object

In [15]:
#making index as name so its easy to access
fd=pd.read_csv('data.csv',index_col='Name')
fd.head()

            No  Type1   Type2  Height  Weight  Legendary
Name
Bulbasaur    1  Grass  Poison     0.7     6.9          0
Ivysaur      2  Grass  Poison     1.0    13.0          0
Venusaur     3  Grass  Poison     2.0   100.0          0
Charmander   4   Fire     NaN     0.6     8.5          0
Charmeleon   5   Fire     NaN     1.1    19.0          0

In [17]:
#accessing by name 
fd.loc['Pikachu']

No                 25
Type1        Electric
Type2             NaN
Height            0.4
Weight            6.0
Legendary           0
Name: Pikachu, dtype: object

In [18]:
fd.loc['Charizard',['Height','Weight']]

Height     1.7
Weight    90.5
Name: Charizard, dtype: object

In [19]:
fd.loc['Charizard':"Blastoise",['Height','Weight']]

           Height  Weight
Name
Charizard     1.7    90.5
Squirtle      0.5     9.0
Wartortle     1.0    22.5
Blastoise     1.6    85.5

In [20]:
fd.iloc[0:11] #[)

            No  Type1   Type2  Height  Weight  Legendary
Name
Bulbasaur    1  Grass  Poison     0.7     6.9          0
Ivysaur      2  Grass  Poison     1.0    13.0          0
Venusaur     3  Grass  Poison     2.0   100.0          0
Charmander   4   Fire     NaN     0.6     8.5          0
Charmeleon   5   Fire     NaN     1.1    19.0          0
Charizard    6   Fire  Flying     1.7    90.5          0
Squirtle     7  Water     NaN     0.5     9.0          0
Wartortle    8  Water     NaN     1.0    22.5          0
Blastoise    9  Water     NaN     1.6    85.5          0
Caterpie    10    Bug     NaN     0.3     2.9          0
Metapod     11    Bug     NaN     0.7     9.9          0

In [21]:
fd.iloc[0:11:2] #step of 2

            No  Type1   Type2  Height  Weight  Legendary
Name
Bulbasaur    1  Grass  Poison     0.7     6.9          0
Venusaur     3  Grass  Poison     2.0   100.0          0
Charmeleon   5   Fire     NaN     1.1    19.0          0
Squirtle     7  Water     NaN     0.5     9.0          0
Blastoise    9  Water     NaN     1.6    85.5          0
Metapod     11    Bug     NaN     0.7     9.9          0

In [22]:
fd.iloc[0:11:2, 0:3] #step of 2 and only first 3 columns

            No  Type1   Type2
Name
Bulbasaur    1  Grass  Poison
Venusaur     3  Grass  Poison
Charmeleon   5   Fire     NaN
Squirtle     7  Water     NaN
Blastoise    9  Water     NaN
Metapod     11    Bug     NaN

In [39]:
pokemon=input('enter a pokemon name')
try:
    print(fd.loc[pokemon])
except KeyError:
    print(f"{pokemon} not found")

enter a pokemon name Snorlax

No              143
Type1        Normal
Type2           NaN
Height          2.1
Weight        460.0
Legendary         0
Name: Snorlax, dtype: object

In [52]:
#filtering:pokemons over 2metres of height
print('pokemons over 2m of height')
tall_pokemon=df[df['Height']>=2]
print(tall_pokemon)
print()
print('pokemons over 100kg of weight')
heavy_pokemon=df[df['Weight']>=100] #over 100kgs of weight
print(heavy_pokemon)
print()
print('legendary pokemons are')
legendary_pokemon=df[df['Legendary']==1] #1 or True - same thing
print(legendary_pokemon)
print()
print('water pokemons are')
water_pokemon=df[(df['Type1']=='Water') | (df['Type2']=='Water' )] #python-'or' logical-'||' but here we're using c style that is '|'
print(water_pokemon)
print()
print("fire and flying pokemons are:")
ff=df[(df['Type1']=='Fire') & (df['Type2']=='Flying' )]
print(ff)

pokemons over 2m of height
      No        Name    Type1    Type2  Height  Weight  Legendary
2      3    Venusaur    Grass   Poison     2.0   100.0          0
22    23       Ekans   Poison      NaN     2.0     6.9          0
23    24       Arbok   Poison      NaN     3.5    65.0          0
94    95        Onix     Rock   Ground     8.8   210.0          0
102  103   Exeggutor    Grass  Psychic     2.0   120.0          0
114  115  Kangaskhan   Normal      NaN     2.2    80.0          0
129  130    Gyarados    Water   Flying     6.5   235.0          0
130  131      Lapras    Water      Ice     2.5   220.0          0
142  143     Snorlax   Normal      NaN     2.1   460.0          0
145  146     Moltres     Fire   Flying     2.0    60.0          1
147  148   Dragonair   Dragon      NaN     4.0    16.5          0
148  149   Dragonite   Dragon   Flying     2.2   210.0          0
149  150      Mewtwo  Psychic      NaN     2.0   122.0          1

pokemons over 100kg of weight
      No       Name     Type1    Type2  Height  Weight  Legendary
2      3   Venusaur     Grass   Poison     2.0   100.0          0
58    59   Arcanine      Fire      NaN     1.9   155.0          0
67    68    Machamp  Fighting      NaN     1.6   130.0          0
74    75   Graveler      Rock   Ground     1.0   105.0          0
75    76      Golem      Rock   Ground     1.4   300.0          0
86    87    Dewgong     Water      Ice     1.7   120.0          0
90    91   Cloyster     Water      Ice     1.5   132.5          0
94    95       Onix      Rock   Ground     8.8   210.0          0
102  103  Exeggutor     Grass  Psychic     2.0   120.0          0
110  111    Rhyhorn    Ground     Rock     1.0   115.0          0
111  112     Rhydon    Ground     Rock     1.9   120.0          0
129  130   Gyarados     Water   Flying     6.5   235.0          0
130  131     Lapras     Water      Ice     2.5   220.0          0
142  143    Snorlax    Normal      NaN     2.1   460.0          0
148  149  Dragonite    Dragon   Flying     2.2   210.0          0
149  150     Mewtwo   Psychic      NaN     2.0   122.0          1

legendary pokemons are
      No      Name     Type1   Type2  Height  Weight  Legendary
143  144  Articuno       Ice  Flying     1.7    55.4          1
144  145    Zapdos  Electric  Flying     1.6    52.6          1
145  146   Moltres      Fire  Flying     2.0    60.0          1
149  150    Mewtwo   Psychic     NaN     2.0   122.0          1

water pokemons are
      No        Name  Type1     Type2  Height  Weight  Legendary
6      7    Squirtle  Water       NaN     0.5     9.0          0
7      8   Wartortle  Water       NaN     1.0    22.5          0
8      9   Blastoise  Water       NaN     1.6    85.5          0
53    54     Psyduck  Water       NaN     0.8    19.6          0
54    55     Golduck  Water       NaN     1.7    76.6          0
59    60     Poliwag  Water       NaN     0.6    12.4          0
60    61   Poliwhirl  Water       NaN     1.0    20.0          0
61    62   Poliwrath  Water  Fighting     1.3    54.0          0
71    72   Tentacool  Water    Poison     0.9    45.5          0
72    73  Tentacruel  Water    Poison     1.6    55.0          0
78    79    Slowpoke  Water   Psychic     1.2    36.0          0
79    80     Slowbro  Water   Psychic     1.6    78.5          0
85    86        Seel  Water       NaN     1.1    90.0          0
86    87     Dewgong  Water       Ice     1.7   120.0          0
89    90    Shellder  Water       NaN     0.3     4.0          0
90    91    Cloyster  Water       Ice     1.5   132.5          0
97    98      Krabby  Water       NaN     0.4     6.5          0
98    99     Kingler  Water       NaN     1.3    60.0          0
115  116      Horsea  Water       NaN     0.4     8.0          0
116  117      Seadra  Water       NaN     1.2    25.0          0
117  118     Goldeen  Water       NaN     0.6    15.0          0
118  119     Seaking  Water       NaN     1.3    39.0          0
119  120      Staryu  Water       NaN     0.8    34.5          0
120  121     Starmie  Water   Psychic     1.1    80.0          0
128  129    Magikarp  Water       NaN     0.9    10.0          0
129  130    Gyarados  Water    Flying     6.5   235.0          0
130  131      Lapras  Water       Ice     2.5   220.0          0
133  134    Vaporeon  Water       NaN     1.0    29.0          0
137  138     Omanyte   Rock     Water     0.4     7.5          0
138  139     Omastar   Rock     Water     1.0    35.0          0
139  140      Kabuto   Rock     Water     0.5    11.5          0
140  141    Kabutops   Rock     Water     1.3    40.5          0

fire and flying pokemons are:
      No       Name Type1   Type2  Height  Weight  Legendary
5      6  Charizard  Fire  Flying     1.7    90.5          0
145  146    Moltres  Fire  Flying     2.0    60.0          1

In [57]:
#Aggregation: reducing set of values to single summary value; used to summarize and analyse data

#aggregate functions for whole data frame
print("mean:")
print(df.mean(numeric_only=True))
print()
print("sum:")
print(df.sum(numeric_only=True))
print()
print("min:")
print(df.min(numeric_only=True))
print()
print("max:")
print(df.max(numeric_only=True))
print()
print("count:")
print(df.count())
print()

mean:
No           75.500000
Height        1.200000
Weight       46.231333
Legendary     0.026667
dtype: float64

sum:
No           11325.0
Height         180.0
Weight        6934.7
Legendary        4.0
dtype: float64

min:
No           1.0
Height       0.2
Weight       0.1
Legendary    0.0
dtype: float64

max:
No           150.0
Height         8.8
Weight       460.0
Legendary      1.0
dtype: float64

count:
No           150
Name         150
Type1        150
Type2         67
Height       150
Weight       150
Legendary    150
dtype: int64

In [59]:
#aggregate functions for single column - height
print("height column")
print("mean:")
print(df['Height'].mean())
print()
print("sum:")
print(df['Height'].sum())
print()
print("min:")
print(df['Height'].min())
print()
print("max:")
print(df['Height'].max())
print()
print("count:")
print(df['Height'].count())
print()

height column
mean:
1.2

sum:
180.0

min:
0.2

max:
8.8

count:
150

In [62]:
#groupby function

 group=df.groupby("Type1")
print(group['Height'].mean())
print()
print(group['Height'].count())

Type1
Bug         0.900000
Dragon      2.666667
Electric    0.855556
Fairy       0.950000
Fighting    1.185714
Fire        1.216667
Ghost       1.466667
Grass       1.083333
Ground      0.850000
Ice         1.550000
Normal      0.986364
Poison      1.221429
Psychic     1.371429
Rock        1.844444
Water       1.300000
Name: Height, dtype: float64

Type1
Bug         12
Dragon       3
Electric     9
Fairy        2
Fighting     7
Fire        12
Ghost        3
Grass       12
Ground       8
Ice          2
Normal      22
Poison      14
Psychic      7
Rock         9
Water       28
Name: Height, dtype: int64

In [ ]:
#data cleaning:process of fixing/removing incomplete, incorrect or irrelevant data

In [66]:
#1. removing unnecessary columns
df=df.drop(columns=['No']) #alr dropped legendary, now dropping number columns
df

           Name    Type1   Type2  Height  Weight
0     Bulbasaur    Grass  Poison     0.7     6.9
1       Ivysaur    Grass  Poison     1.0    13.0
2      Venusaur    Grass  Poison     2.0   100.0
3    Charmander     Fire     NaN     0.6     8.5
4    Charmeleon     Fire     NaN     1.1    19.0
..          ...      ...     ...     ...     ...
145     Moltres     Fire  Flying     2.0    60.0
146     Dratini   Dragon     NaN     1.8     3.3
147   Dragonair   Dragon     NaN     4.0    16.5
148   Dragonite   Dragon  Flying     2.2   210.0
149      Mewtwo  Psychic     NaN     2.0   122.0

[150 rows x 5 columns]

In [71]:
#2.dropping rows with unknown values
q=pd.read_csv('data.csv')
q=q.dropna(subset=['Type2'])
q

      No        Name     Type1   Type2  Height  Weight  Legendary
0      1   Bulbasaur     Grass  Poison     0.7     6.9          0
1      2     Ivysaur     Grass  Poison     1.0    13.0          0
2      3    Venusaur     Grass  Poison     2.0   100.0          0
5      6   Charizard      Fire  Flying     1.7    90.5          0
11    12  Butterfree       Bug  Flying     1.1    32.0          0
..   ...         ...       ...     ...     ...     ...        ...
141  142  Aerodactyl      Rock  Flying     1.8    59.0          0
143  144    Articuno       Ice  Flying     1.7    55.4          1
144  145      Zapdos  Electric  Flying     1.6    52.6          1
145  146     Moltres      Fire  Flying     2.0    60.0          1
148  149   Dragonite    Dragon  Flying     2.2   210.0          0

[67 rows x 7 columns]

In [73]:
#3.replacing missing values
qr=pd.read_csv('data.csv')
qr=qr.fillna({'Type2':"None"})
qr

      No        Name    Type1   Type2  Height  Weight  Legendary
0      1   Bulbasaur    Grass  Poison     0.7     6.9          0
1      2     Ivysaur    Grass  Poison     1.0    13.0          0
2      3    Venusaur    Grass  Poison     2.0   100.0          0
3      4  Charmander     Fire    None     0.6     8.5          0
4      5  Charmeleon     Fire    None     1.1    19.0          0
..   ...         ...      ...     ...     ...     ...        ...
145  146     Moltres     Fire  Flying     2.0    60.0          1
146  147     Dratini   Dragon    None     1.8     3.3          0
147  148   Dragonair   Dragon    None     4.0    16.5          0
148  149   Dragonite   Dragon  Flying     2.2   210.0          0
149  150      Mewtwo  Psychic    None     2.0   122.0          1

[150 rows x 7 columns]

In [76]:
#4.inconsistent values
p=pd.read_csv('data.csv')
p['Type1']=p['Type1'].replace({"Grass":"GRASS","Fire":"FIRE","Dragon":"DRAGON"})
p

      No        Name    Type1   Type2  Height  Weight  Legendary
0      1   Bulbasaur    GRASS  Poison     0.7     6.9          0
1      2     Ivysaur    GRASS  Poison     1.0    13.0          0
2      3    Venusaur    GRASS  Poison     2.0   100.0          0
3      4  Charmander     FIRE     NaN     0.6     8.5          0
4      5  Charmeleon     FIRE     NaN     1.1    19.0          0
..   ...         ...      ...     ...     ...     ...        ...
145  146     Moltres     FIRE  Flying     2.0    60.0          1
146  147     Dratini   DRAGON     NaN     1.8     3.3          0
147  148   Dragonair   DRAGON     NaN     4.0    16.5          0
148  149   Dragonite   DRAGON  Flying     2.2   210.0          0
149  150      Mewtwo  Psychic     NaN     2.0   122.0          1

[150 rows x 7 columns]

In [78]:
#5.standardize text
p["Name"]=p["Name"].str.lower()
p

      No        Name    Type1   Type2  Height  Weight  Legendary
0      1   bulbasaur    GRASS  Poison     0.7     6.9          0
1      2     ivysaur    GRASS  Poison     1.0    13.0          0
2      3    venusaur    GRASS  Poison     2.0   100.0          0
3      4  charmander     FIRE     NaN     0.6     8.5          0
4      5  charmeleon     FIRE     NaN     1.1    19.0          0
..   ...         ...      ...     ...     ...     ...        ...
145  146     moltres     FIRE  Flying     2.0    60.0          1
146  147     dratini   DRAGON     NaN     1.8     3.3          0
147  148   dragonair   DRAGON     NaN     4.0    16.5          0
148  149   dragonite   DRAGON  Flying     2.2   210.0          0
149  150      mewtwo  Psychic     NaN     2.0   122.0          1

[150 rows x 7 columns]

In [79]:
#6.fix data types
p["Legendary"]=p["Legendary"].astype(bool)
p

      No        Name    Type1   Type2  Height  Weight  Legendary
0      1   bulbasaur    GRASS  Poison     0.7     6.9      False
1      2     ivysaur    GRASS  Poison     1.0    13.0      False
2      3    venusaur    GRASS  Poison     2.0   100.0      False
3      4  charmander     FIRE     NaN     0.6     8.5      False
4      5  charmeleon     FIRE     NaN     1.1    19.0      False
..   ...         ...      ...     ...     ...     ...        ...
145  146     moltres     FIRE  Flying     2.0    60.0       True
146  147     dratini   DRAGON     NaN     1.8     3.3      False
147  148   dragonair   DRAGON     NaN     4.0    16.5      False
148  149   dragonite   DRAGON  Flying     2.2   210.0      False
149  150      mewtwo  Psychic     NaN     2.0   122.0       True

[150 rows x 7 columns]

In [82]:
#7. drop duplicates
p=p.drop_duplicates() #there were no duplicates
p

      No        Name    Type1   Type2  Height  Weight  Legendary
0      1   bulbasaur    GRASS  Poison     0.7     6.9        0.0
1      2     ivysaur    GRASS  Poison     1.0    13.0        0.0
2      3    venusaur    GRASS  Poison     2.0   100.0        0.0
3      4  charmander     FIRE     NaN     0.6     8.5        0.0
4      5  charmeleon     FIRE     NaN     1.1    19.0        0.0
..   ...         ...      ...     ...     ...     ...        ...
145  146     moltres     FIRE  Flying     2.0    60.0        1.0
146  147     dratini   DRAGON     NaN     1.8     3.3        0.0
147  148   dragonair   DRAGON     NaN     4.0    16.5        0.0
148  149   dragonite   DRAGON  Flying     2.2   210.0        0.0
149  150      mewtwo  Psychic     NaN     2.0   122.0        1.0

[150 rows x 7 columns]